Revit 2024 API
OrdinateDimensionSetting Members
The OrdinateDimensionSetting type exposes the following members.
Constructors
Name | Description
OrdinateDimensionSetting
 Constructs a new OrdinateDimensionSetting object with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the OrdinateDimensionSetting
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DimensionLineLength
 Specifies the dimension line segment length. This setting is enabled when Dimension Line Style is Segmented.
DimensionLineStyle
 Specifies the dimension line style.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginTickMarkId
 Specifies the id of the tick mark element to use for the dimension origin.
OriginVisibility
 Specifies thevisibility of the origin witness line for the ordinate dimension (this is the first witness line in the string).
TextOrientation
 Specifies where to align the dimension text.
TextPosition
 Specifies the dimension text position.
See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace